arryardhiana/esp8266-multi-dht22-to-modbus/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <EEPROM.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

// ---------------------------------------------------------------------------
// Pin map (Wemos D1 Mini). Lihat README untuk skematik & voltage divider.
// ---------------------------------------------------------------------------
constexpr uint8_t DHTPIN1 = D5;        // GPIO14 - DATA DHT22 #1
constexpr uint8_t DHTPIN2 = D6;        // GPIO12 - DATA DHT22 #2
constexpr uint8_t DHTTYPE = DHT22;
// Modbus RTU di hardware Serial: GPIO1 (TX0) -> RS485 driver DI, GPIO3 (RX0) <- RO.
// OLED dipasang di I2C default: SDA=D2 (GPIO4), SCL=D1 (GPIO5).
// Debug log di Serial1 (GPIO2, TX-only).

// ---------------------------------------------------------------------------
// Modbus RTU (di atas RS485 via SoftwareSerial).
// ---------------------------------------------------------------------------
constexpr uint8_t MODBUS_SLAVE_ID_DEFAULT = 10;
constexpr uint8_t MODBUS_SLAVE_ID_MIN = 1;
constexpr uint8_t MODBUS_SLAVE_ID_MAX = 247;
constexpr uint32_t MODBUS_BAUDRATE = 9600;
constexpr uint32_t MODBUS_FRAME_GAP_US = 4000;  // >3.5 char @ 9600 baud
constexpr size_t MODBUS_RX_BUFFER_SIZE = 64;
constexpr bool ENABLE_MODBUS_RX_LOG = true;  // log frame masuk ke dashboard (diagnosa)
// Self-test UART: kirim byte uji ke TX (GPIO1) tiap 2 dtk. Lepas modul RS485,
// jumper GPIO1<->GPIO3, set true & flash: kalau RX Bytes naik -> UART RX ESP sehat,
// masalah murni di modul/kabel/ground. Kembalikan ke false untuk operasi normal.
constexpr bool ENABLE_UART_LOOPBACK_TEST = false;

// ---------------------------------------------------------------------------
// Sensor poll.
// ---------------------------------------------------------------------------
constexpr uint32_t READ_INTERVAL = 5000;  // ms, > 2000ms minimum DHT22
constexpr uint8_t RETRY_MAX = 5;          // siklus gagal beruntun sebelum status error
constexpr float TEMP_MIN = -40.0f;
constexpr float TEMP_MAX = 80.0f;
constexpr float HUM_MIN = 0.0f;
constexpr float HUM_MAX = 100.0f;

// ---------------------------------------------------------------------------
// Diagnostik & WiFi.
// ---------------------------------------------------------------------------
constexpr bool ENABLE_SENSOR_SERIAL_LOG = true;
constexpr uint32_t SENSOR_LOG_BAUDRATE = 115200;
constexpr char WIFI_AP_SSID[] = "WemosModbusAP";
constexpr char WIFI_AP_PASSWORD[] = "modbus123";
constexpr size_t LOG_BUFFER_SIZE = 32;
constexpr size_t LOG_MESSAGE_MAX = 96;

// ---------------------------------------------------------------------------
// OLED SSD1306 128x64.
// ---------------------------------------------------------------------------
constexpr uint8_t OLED_I2C_ADDRESS = 0x3C;
constexpr uint8_t OLED_I2C_ADDRESS_ALT = 0x3D;  // sebagian modul pakai 0x3D
constexpr int16_t SCREEN_WIDTH = 128;
constexpr int16_t SCREEN_HEIGHT = 64;
constexpr int8_t OLED_RESET = -1;  // tanpa pin reset terpisah

// ---------------------------------------------------------------------------
// Layout EEPROM untuk slave ID persisten.
// ---------------------------------------------------------------------------
constexpr size_t EEPROM_SIZE = 16;
constexpr int EEPROM_ADDR_MAGIC = 0;     // 2 byte
constexpr int EEPROM_ADDR_SLAVE_ID = 2;  // 1 byte
constexpr uint16_t EEPROM_MAGIC = 0xCAFE;

// ---------------------------------------------------------------------------
// Holding register map (size 20, indeks 0..5 dipakai).
// ---------------------------------------------------------------------------
constexpr uint16_t REG_TEMP1 = 0x0000;    // suhu #1, signed 0.1 C
constexpr uint16_t REG_HUM1 = 0x0001;     // kelembaban #1, unsigned 0.1 %RH
constexpr uint16_t REG_TEMP2 = 0x0002;    // suhu #2, signed 0.1 C
constexpr uint16_t REG_HUM2 = 0x0003;     // kelembaban #2, unsigned 0.1 %RH
constexpr uint16_t REG_STATUS1 = 0x0004;  // status #1 (0=ok,1=init,2=read err)
constexpr uint16_t REG_STATUS2 = 0x0005;  // status #2
constexpr uint16_t HOLDING_REGISTER_COUNT = 20;

// ---------------------------------------------------------------------------
// State global.
// ---------------------------------------------------------------------------
DHT dht1(DHTPIN1, DHTTYPE);
DHT dht2(DHTPIN2, DHTTYPE);
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
ESP8266WebServer webServer(80);

bool oledOnline = false;
uint8_t oledAddress = 0;  // alamat I2C OLED aktif (0 = belum terdeteksi)
uint32_t modbusRxByteCount = 0;  // total byte mentah diterima di Serial RX (diagnosa)
uint32_t lastSensorSample = 0;
uint16_t holdingRegisters[HOLDING_REGISTER_COUNT] = {0};
float lastTemperature[2] = {NAN, NAN};
float lastHumidity[2] = {NAN, NAN};
uint8_t sensorStatus[2] = {1, 1};   // 0=ok, 1=init error, 2=read error
uint8_t sensorFailCount[2] = {0, 0};
uint8_t modbusSlaveId = MODBUS_SLAVE_ID_DEFAULT;

char logBuffer[LOG_BUFFER_SIZE][LOG_MESSAGE_MAX];
size_t logNextIndex = 0;
size_t logEntryCount = 0;

// Prototipe.
void pollSensor(uint8_t index, DHT& dht);
void updateHoldingRegisters();
void scanI2cBus();
bool i2cDevicePresent(uint8_t address);
bool initOled();
void updateOled();
void handleModbusInput();
void processModbusFrame(const uint8_t* frame, size_t length);
void sendHoldingRegisters(uint16_t startAddress, uint16_t count, uint8_t function);
void sendModbusException(uint8_t function, uint8_t exceptionCode);
uint16_t modbusCRC(const uint8_t* data, size_t length);
void logSensorMessage(const char* message);
void logSensorReading(uint8_t index, float temperatureC, float humidity);
void appendLog(const char* message);
void handleHttpRoot();
void handleHttpSaveSlaveId();
void loadSlaveIdFromEeprom();
bool saveSlaveIdToEeprom(uint8_t newId);
String formatFloat(float value, const char* unit);
String formatOledValue(float value, const char* unit);
const char* sensorStatusText(uint8_t status);

// Konversi float ke signed tenths di uint16_t register.
uint16_t encodeSignedTenths(float value) {
  if (isnan(value)) {
    return 0;
  }

  long scaled = lroundf(value * 10.0f);
  if (scaled > 999) {
    scaled = 999;
  } else if (scaled < -999) {
    scaled = -999;
  }

  return static_cast<uint16_t>(static_cast<int16_t>(scaled));
}

