arryardhiana/esp8266-multi-dht22-to-modbus/src/main.cpp
// Konversi float ke unsigned tenths di uint16_t register.
uint16_t encodeUnsignedTenths(float value) {
  if (isnan(value) || value < 0.0f) {
    return 0;
  }

  long scaled = lroundf(value * 10.0f);
  if (scaled > 999) {
    scaled = 999;
  }

  return static_cast<uint16_t>(scaled);
}

void setup() {
  Wire.begin(D2, D1);  // SDA, SCL untuk OLED

  if (ENABLE_SENSOR_SERIAL_LOG) {
    Serial1.begin(SENSOR_LOG_BAUDRATE);  // GPIO2, TX-only
    logSensorMessage("Sensor logger started");
  }

  EEPROM.begin(EEPROM_SIZE);
  loadSlaveIdFromEeprom();
  char slaveMsg[48];
  snprintf(slaveMsg, sizeof(slaveMsg), "Modbus slave ID = %u", modbusSlaveId);
  logSensorMessage(slaveMsg);

  dht1.begin();
  dht2.begin();
  logSensorMessage("DHT22 x2 initialized");

  Serial.begin(MODBUS_BAUDRATE, SERIAL_8N1);  // hardware UART0 -> RS485 driver
  logSensorMessage("Modbus on hardware Serial @9600");

  scanI2cBus();  // log alamat I2C yang terdeteksi untuk diagnosa OLED
  oledOnline = initOled();
  if (oledOnline) {
    logSensorMessage("OLED SSD1306 detected");
  } else {
    logSensorMessage("OLED not detected, continuing without display");
  }

  WiFi.mode(WIFI_AP);
  WiFi.softAP(WIFI_AP_SSID, WIFI_AP_PASSWORD);
  IPAddress apIp = WiFi.softAPIP();
  char ipMessage[64];
  snprintf(ipMessage, sizeof(ipMessage), "AP up %s (%s)", WIFI_AP_SSID,
           apIp.toString().c_str());
  logSensorMessage(ipMessage);

  webServer.on("/", handleHttpRoot);
  webServer.on("/save-slave-id", HTTP_POST, handleHttpSaveSlaveId);
  webServer.begin();

  // Paksa pembacaan pertama segera di loop().
  lastSensorSample = millis() - READ_INTERVAL;
}

void loop() {
  handleModbusInput();
  webServer.handleClient();

  const uint32_t now = millis();

  if (ENABLE_UART_LOOPBACK_TEST) {
    static uint32_t lastLoopbackMs = 0;
    if (now - lastLoopbackMs >= 2000) {
      lastLoopbackMs = now;
      Serial.write(0x55);  // jumper GPIO1->GPIO3 -> RX Bytes harus naik
      logSensorMessage("loopback: kirim 0x55 ke TX (GPIO1)");
    }
  }

  if (now - lastSensorSample >= READ_INTERVAL) {
    lastSensorSample = now;

    pollSensor(0, dht1);
    pollSensor(1, dht2);
    updateHoldingRegisters();

    // Status OLED live: verifikasi keberadaan via ACK I2C tiap siklus, supaya
    // cabut/colok saat runtime terdeteksi (bukan hanya saat boot).
    const bool oledPresent =
        oledOnline ? i2cDevicePresent(oledAddress)
                   : (i2cDevicePresent(OLED_I2C_ADDRESS) ||
                      i2cDevicePresent(OLED_I2C_ADDRESS_ALT));

    if (oledPresent && !oledOnline) {
      oledOnline = initOled();  // (re)init hot-plug
      if (oledOnline) {
        logSensorMessage("OLED terhubung");
      }
    } else if (!oledPresent && oledOnline) {
      oledOnline = false;
      oledAddress = 0;
      logSensorMessage("OLED terputus");
    }
    updateOled();
  }
}

// Baca satu sensor; validasi range. Tidak pakai delay() — retry dihitung sebagai
// jumlah siklus gagal beruntun, status jadi read-error (2) setelah RETRY_MAX.
void pollSensor(uint8_t index, DHT& dht) {
  const float temperatureC = dht.readTemperature();
  const float humidity = dht.readHumidity();

  const bool valid = !isnan(temperatureC) && !isnan(humidity) &&
                     temperatureC >= TEMP_MIN && temperatureC <= TEMP_MAX &&
                     humidity >= HUM_MIN && humidity <= HUM_MAX;

  if (valid) {
    lastTemperature[index] = temperatureC;
    lastHumidity[index] = humidity;
    sensorStatus[index] = 0;
    sensorFailCount[index] = 0;
    logSensorReading(index, temperatureC, humidity);
    return;
  }

  // Bacaan invalid: jangan update register dengan data buruk.
  if (sensorFailCount[index] < RETRY_MAX) {
    ++sensorFailCount[index];
  }
  if (sensorFailCount[index] >= RETRY_MAX) {
    sensorStatus[index] = 2;  // read error
  }

  char message[64];
  snprintf(message, sizeof(message), "DHT22 #%u read error (%u/%u)",
           static_cast<unsigned>(index + 1),
           static_cast<unsigned>(sensorFailCount[index]),
           static_cast<unsigned>(RETRY_MAX));
  logSensorMessage(message);
}

void updateHoldingRegisters() {
  holdingRegisters[REG_TEMP1] = encodeSignedTenths(lastTemperature[0]);
  holdingRegisters[REG_HUM1] = encodeUnsignedTenths(lastHumidity[0]);
  holdingRegisters[REG_TEMP2] = encodeSignedTenths(lastTemperature[1]);
  holdingRegisters[REG_HUM2] = encodeUnsignedTenths(lastHumidity[1]);
  holdingRegisters[REG_STATUS1] = sensorStatus[0];
  holdingRegisters[REG_STATUS2] = sensorStatus[1];
}

// True bila ada device I2C yang meng-ACK di alamat tsb.
bool i2cDevicePresent(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

// Scan bus I2C dan log tiap alamat yang merespons (untuk diagnosa OLED).
void scanI2cBus() {
  uint8_t found = 0;
  for (uint8_t addr = 1; addr < 127; ++addr) {
    if (i2cDevicePresent(addr)) {
      char message[24];
      snprintf(message, sizeof(message), "I2C device @0x%02X", addr);
      logSensorMessage(message);
      ++found;
    }
  }
  if (found == 0) {
    logSensorMessage("I2C: tidak ada device (cek wiring SDA D2/SCL D1)");
  }
}

// Cek keberadaan OLED lewat ACK I2C lebih dulu (display.begin() tidak verifikasi
// device, selalu sukses selama buffer teralokasi). Coba 0x3C lalu 0x3D.
bool initOled() {
  uint8_t address = 0;
  if (i2cDevicePresent(OLED_I2C_ADDRESS)) {
    address = OLED_I2C_ADDRESS;
  } else if (i2cDevicePresent(OLED_I2C_ADDRESS_ALT)) {
    address = OLED_I2C_ADDRESS_ALT;
  }

  if (address == 0 || !display.begin(SSD1306_SWITCHCAPVCC, address)) {
    oledAddress = 0;
    return false;
  }

  oledAddress = address;
  display.clearDisplay();
  display.display();
  return true;
}

void updateOled() {
  if (!oledOnline) {
    return;
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  display.setCursor(0, 0);
  display.println(F("Sensor 1"));
  display.print(F("Suhu : "));
  display.println(formatOledValue(lastTemperature[0], "C"));
  display.print(F("Humid: "));
  display.println(formatOledValue(lastHumidity[0], "%"));

  display.setCursor(0, 32);
  display.println(F("Sensor 2"));
  display.print(F("Suhu : "));
  display.println(formatOledValue(lastTemperature[1], "C"));
  display.print(F("Humid: "));
  display.println(formatOledValue(lastHumidity[1], "%"));

  display.setCursor(0, 56);
  char bottom[24];
  snprintf(bottom, sizeof(bottom), "ID:%u  RS485 OK", modbusSlaveId);
  display.print(bottom);

